class Text_UA:
    GREETING = "Вітаю вас, друзі!"
    START = "Будемо знайомі, {name}!"
    BIRTHDAY_ALREADY = "Мені вже відома твоя дата народження - {birthdate}!\nЯкщо хочеш змінити її - пропиши знову у форматі ДД.ММ.\nЯкщо передумаєш - виклич команду /cancel."
    BIRTHDAY_ENTER = "Введи свою дату народження у форматі ДД.ММ.\nЦе потрібно, аби я зміг тебе привітати у чатах, де є ти і цей бот."
    CANCELED = "Дію відмінено."
    NOTHING_CANCELED = "Нічого відміняти."
    WRONG_FORMAT = "Невірний формат дати. Перевір ще раз, має бути ДД.ММ."
    SUCCESS_BIRTHDATE = "Твоя дата успішно додана!"
    MONTHS = {
        1: "Січень", 2: "Лютий", 3: "Березень", 4: "Квітень",
        5: "Травень", 6: "Червень", 7: "Липень", 8: "Серпень",
        9: "Вересень", 10: "Жовтень", 11: "Листопад", 12: "Грудень"
    }
    CALENDAR_HEADER = "Календар групи {group_title}"
    NO_BIRTHDAYS = "🤷‍♂️У групі не знайдено нікого з зареєстрованим днем народження..."
    NO_GROUPS = "🤷‍♂️Ви ще не приєднались до жодної групи..."
    CHOOSE_GROUP = "Оберіть з списку групу, календар якої ви хочете переглянути👇"
    BUTTON_BACK = "Назад🔙"
    HIDE_MENU = "Оберіть з списку групу, від учасників якої ви хочете приховати свій день народження👇"
    HIDE_CHANGED = "Видимість успішно змінена."
    REG = "✅Відтепер вас буде залучено у загальні заклики.\nДля виходу з закликів виконайте команду /unreg."
    UNREG = "❎Відтепер вас не буде залучено у загальні заклики.\nДля повернення у заклики виконайте команду /reg."
    NO_CALL = "🤷‍♂️Нікого закликати."
    CONFIRM_CALL_HEADERS = [
        "Воу-воу-воу!",
        "Донт пуш зе хорсес!",
        "Секунду!",
        "Зупинись, бро!",
        "А тут ми зупинимось!",
        "Зачекай!",
        "Алярм!"
    ]
    CONFIRM_CALL = "\n\nУ цій групі багато учасників зареєстровані у загальний заклик.\nТи ТОЧНО хочеш закликати їх усіх?"
    YES = "ТАК"
    NO = "Ні"
    WRONG_CALLER = "Не ти закликав - не тобі клацати тут!😠"
    CANCELED_CALL = "Заклик скасовано. Можна видихнути..."
    RUNOUT = "Час на підтвердження сплив."
    NO_REASON_HEADERS = [
        "оголосив(-ла) загальний заклик!",
        "скликає народне віче!",
        "чекає на всіх у цьому чаті!",
        "просить усіх відгукнутись!",
        "збирає всіх до столу!"
    ]
    BIRTHDAY_MESSAGES = [
    "🎉 Вітаємо з днем народження, {mention}! Бажаємо міцного здоров'я, щастя та безмежного успіху в усіх справах!",
    "🎂 Сьогодні своє свято відзначає {mention}! Нехай кожен день приносить тільки позитивні емоції та нові перемоги. Зі святом!",
    "🎁 З днем народження, {mention}! Бажаємо невичерпної енергії, натхнення та здійснення найзаповітніших мрій!",
    "🥳 Найкращі побажання для {mention} у цей день! Нехай життя буде наповнене радістю, гармонією та приємними сюрпризами.",
    "🥂 {mention}, з днем народження! Успіхів, кар'єрного та особистого зростання, а також чудового настрою на весь рік вперед!",
    "🌟 Вітаємо {mention} зі святом! Бажаємо затишку, добробуту, вірних друзів поруч та удачі у всіх починаннях.",
    "🎈 Сьогодні чудовий день, адже свій день народження святкує {mention}! Бажаємо круто провести час, отримати бажані подарунки та безліч усмішок.",
    "🎊 {mention}, вітаємо з днем народження! Нехай усе задумане легко втілюється в життя, а кожен новий день буде кращим за попередній!"
    ]
    TOMORROW_MESSAGE = "Хей! Завтра у {name} день народження (з групи {group}).\nНе забудь привітати його/її!🙂"